app/views/ideas/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 3]]
---
    <h1>Comments</h1>
    <% @idea.comments.each do |comment| %>