app/controllers/comments_controller.rb

  def create
    # idea = Idea.find(params[:id])
    # @comment = @idea.comments.build(:idea => idea)
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_name", "body", "idea_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "jess"], ["body", "ll"], ["idea_id", 3], ["created_at", "2015-11-18 02:47:40.715143"], ["updated_at", "2015-11-18 02:47:40.715143"]]