app/controllers/ideas_controller.rb

  def show
    @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "idea1"], ["description", "texts"], ["picture", "pic 1"], ["created_at", "2015-11-13 05:57:42.255932"], ["updated_at", "2015-11-13 05:57:42.255932"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "name" = ?, "description" = ?, "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "Start up"], ["description", "New View"], ["picture", "logo2.jpeg"], ["updated_at", "2015-11-19 01:26:11.301344"], ["id", 3]]